alter Table Товары ADD Дата_поступления Date;
alter Table Student add POL nchar(50) default 'м' check (POL in ( 'м', 'ж'))
alter Table Товары DROP Column Дата_поступления ;

insert into ТОВАРЫ(Наименование,Цена,Количество)
	Values('Стол',100,5),
	('Шкаф',200,3);
insert into ЗАКАЗЫ(Дата_поставки,Заказчик,Количество,Наименование_товара,Номер_заказа,Цена_продажи)
	Values('2020-9-23','Вадим',2,'Стол','1',100),
	('2020-7-13','Никита',2,'Шкаф','2',200);
insert into ЗАКАЗЧИКИ(Наименование_фирмы,Расчетный_счёт,Адрес)
	Values('Вадим',122,'ул. Уличная д.2'),
	('Никита',334,'ул. Депресивная д.56');

	select * From ТОВАРЫ;
	select Наименование, Цена From ТОВАРЫ;
	select count(*) From ТОВАРЫ;
	select Наименование [Дешевые товары] From ТОВАРЫ
		where Цена <200
	select Distinct Top(2) Наименование_товара,Цена_продажи
		From ЗАКАЗЫ order by Цена_продажи Desc;

		UPDATE ТОВАРЫ set Количество = 1;
		UPDATE ТОВАРЫ set Цена = Цена+1 Where Наименование = 'Стол';
		DELETE from ТОВАРЫ Where Наименование = 'Стол';

select Distinct Наименование_товара, Цена_продажи, Дата_поставки 
	From ЗАКАЗЫ Where Дата_поставки Between '2019-05-07' and '2021-05-10'
select Наименование_товара From ЗАКАЗЫ
	where Наименование_товара Like 'Ш%'
select Distinct Наименование_товара From ТОВАРЫ
	Where Цена_продажи In(15,210)

